In [1]:
import pandas as pd
df2= {'Team':['Riders','Riders','Devils','Devils','Kings','Kings','Kings','Kings','Riders','Royals','Royals','Royals'],
            'Rank':[1,2,2,3,3,4,1,1,2,4,1,2],
            'Year':[2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
            'Points':[876,789,863,673,741,812,756,788,694,701,884,690],
            
           }
df=pd.DataFrame(df2)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     884
11  Royals     2  2017     690

In [6]:
df.shape

(12, 4)

In [7]:
df.columns

Index(['Team', 'Rank', 'Year', 'Points'], dtype='object')

In [8]:
df["Team"].unique()

array(['Riders', 'Devils', 'Kings', 'Royals'], dtype=object)

In [9]:
df["Team"].nunique()

4

In [11]:
r=df.groupby("Team")["Points"]
r

In [14]:
r.value_counts()

Team    Points
Devils  673       1
        863       1
Kings   741       1
        756       1
        788       1
        812       1
Riders  694       1
        789       1
        876       1
Royals  690       1
        701       1
        884       1
Name: count, dtype: int64

In [15]:
r.sum()

Team
Devils    1536
Kings     3097
Riders    2359
Royals    2275
Name: Points, dtype: int64

In [21]:
# Har team ke kitne records (rows) hain?
df["Team"].value_counts()

Team
Kings     4
Riders    3
Royals    3
Devils    2
Name: count, dtype: int64

In [23]:
# Dataset me unique years kaun-kaun se hain?
df["Year"].unique()

array([2014, 2015, 2016, 2017])

In [25]:
# Dataset me minimum points aur maximum points kya hain?
print(df["Points"].min())
print(df["Points"].max())

673
884

In [26]:
# Dataset ka average (mean) points kya hai?
["Points"].mean()

np.float64(772.25)

In [27]:
# Kaunsi team ne sabse zyada points score kiye hain (single record me)?
df[["Team","Points"]].max()

Team      Royals
Points       884
dtype: object

In [40]:
# Kaunsa year me sabse zyada matches / records hain?
df["Team"].value_counts().head(1)

Team
Kings    4
Name: count, dtype: int64

In [43]:
# Dataset me Rank = 1 wale kitne records hain?
df[df["Rank"]==1]

      Team  Rank  Year  Points
0   Riders     1  2014     876
6    Kings     1  2016     756
7    Kings     1  2017     788
10  Royals     1  2015     884

In [53]:
# Points aur Rank column ka data type kya hai?
print(df["Points"].dtype)
print(df["Rank"].dtype)

int64
int64

In [57]:
# Kya dataset me missing values hain?
df.isnull().sum()

Team      0
Rank      0
Year      0
Points    0
dtype: int64

In [59]:
# Dataset ko first 5 rows aur last 5 rows me dikhao.
print(df.head()) # first 5 row
print(df.tail())  # last 5 row

     Team  Rank  Year  Points
0  Riders     1  2014     876
1  Riders     2  2015     789
2  Devils     2  2014     863
3  Devils     3  2015     673
4   Kings     3  2014     741
      Team  Rank  Year  Points
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     884
11  Royals     2  2017     690

In [67]:
# Dataset ko Year ke ascending order me sort karo.
df.sort_values(by="Year",ascending=False)

      Team  Rank  Year  Points
7    Kings     1  2017     788
11  Royals     2  2017     690
6    Kings     1  2016     756
8   Riders     2  2016     694
1   Riders     2  2015     789
3   Devils     3  2015     673
5    Kings     4  2015     812
10  Royals     1  2015     884
0   Riders     1  2014     876
2   Devils     2  2014     863
4    Kings     3  2014     741
9   Royals     4  2014     701

In [69]:
# Sirf Riders team ka data filter karke dikhao.
df[df["Team"]=="Riders"]

     Team  Rank  Year  Points
0  Riders     1  2014     876
1  Riders     2  2015     789
8  Riders     2  2016     694